In [27]:
import pandas as pd
import numpy as np
from env import host, user, password
from pydataset import data

In [2]:
# Create a function named get_db_url. It should accept a username, hostname, password, and database name and 
# return a url connection string formatted like in the example at the start of this lesson.

def get_db_url(user, host, password, dbname):
    return f'mysql+pymysql://{user}:{password}@{host}/{dbname}'

In [4]:
# Use your function to obtain a connection to the employees database.
url = get_db_url(user, host, password, 'employees')

In [5]:
pd.read_sql('SELECT * FROM employees LIMIT 5 OFFSET 50', url)

   emp_no  birth_date first_name  last_name gender   hire_date
0   10051  1953-07-28   Hidefumi      Caine      M  1992-10-15
1   10052  1961-02-26     Heping     Nitsch      M  1988-05-21
2   10053  1954-09-13     Sanjiv   Zschoche      F  1986-02-04
3   10054  1957-04-04     Mayumi  Schueller      M  1995-03-13
4   10055  1956-06-06     Georgy     Dredge      M  1992-04-27

In [6]:
# Read the employees and titles tables into two separate DataFrames.
employees_df = pd.read_sql('SELECT * FROM employees', url)
titles_df = pd.read_sql('SELECT * FROM titles', url)

In [7]:
# How many rows and columns do you have in each DataFrame? Is that what you expected?
employees_df.shape

(300024, 6)

In [8]:
titles_df.shape

(443308, 4)

In [9]:
# Display the summary statistics for each DataFrame.
employees_df.describe()

              emp_no
count  300024.000000
mean   253321.763392
std    161828.235540
min     10001.000000
25%     85006.750000
50%    249987.500000
75%    424993.250000
max    499999.000000

In [10]:
titles_df.describe()

              emp_no
count  443308.000000
mean   253075.034430
std    161853.292613
min     10001.000000
25%     84855.750000
50%    249847.500000
75%    424891.250000
max    499999.000000

In [11]:
# How many unique titles are in the titles DataFrame?
pd.read_sql('SELECT DISTINCT title FROM titles', url).shape[0]

7

In [12]:
# What is the oldest date in the to_date column?
pd.read_sql('SELECT to_date FROM titles ORDER BY to_date ASC LIMIT 1', url)

      to_date
0  1985-03-01

In [13]:
# What is the most recent date in the to_date column?
pd.read_sql('SELECT max(to_date) FROM titles WHERE to_date NOT LIKE "%9999%"', url)

  max(to_date)
0   2002-08-01

In [16]:
users = pd.DataFrame({
    'id': [1, 2, 3, 4, 5, 6],
    'name': ['bob', 'joe', 'sally', 'adam', 'jane', 'mike'],
    'role_id': [1, 2, 3, 3, np.nan, np.nan]
})
users

   id   name  role_id
0   1    bob      1.0
1   2    joe      2.0
2   3  sally      3.0
3   4   adam      3.0
4   5   jane      NaN
5   6   mike      NaN

In [17]:
roles = pd.DataFrame({
    'id': [1, 2, 3, 4],
    'name': ['admin', 'author', 'reviewer', 'commenter']
})
roles

   id       name
0   1      admin
1   2     author
2   3   reviewer
3   4  commenter

In [21]:
# What is the result of using a right join on the DataFrames?
users.merge(roles, how='right', left_on='role_id', right_on='id')

   id_x name_x  role_id  id_y     name_y
0   1.0    bob      1.0     1      admin
1   2.0    joe      2.0     2     author
2   3.0  sally      3.0     3   reviewer
3   4.0   adam      3.0     3   reviewer
4   NaN    NaN      NaN     4  commenter

In [22]:
# What is the result of using an outer join on the DataFrames?
users.merge(roles, how='outer', left_on='role_id', right_on='id')

   id_x name_x  role_id  id_y     name_y
0   1.0    bob      1.0   1.0      admin
1   2.0    joe      2.0   2.0     author
2   3.0  sally      3.0   3.0   reviewer
3   4.0   adam      3.0   3.0   reviewer
4   5.0   jane      NaN   NaN        NaN
5   6.0   mike      NaN   NaN        NaN
6   NaN    NaN      NaN   4.0  commenter

In [25]:
# What happens if you drop the foreign keys from the DataFrames and try to merge them?
users.merge(roles, how='outer')

        name  role_id   id
0        bob      1.0  NaN
1        joe      2.0  NaN
2      sally      3.0  NaN
3       adam      3.0  NaN
4       jane      NaN  NaN
5       mike      NaN  NaN
6      admin      NaN  1.0
7     author      NaN  2.0
8   reviewer      NaN  3.0
9  commenter      NaN  4.0

In [28]:
# Load the mpg dataset from PyDataset.
mpg = data('mpg')

In [29]:
# Output and read the documentation for the mpg dataset.
data('mpg', show_doc=True)

mpg

PyDataset Documentation (adopted from R Documentation. The displayed examples are in R)

## Fuel economy data from 1999 and 2008 for 38 popular models of car

### Description

This dataset contains a subset of the fuel economy data that the EPA makes
available on http://fueleconomy.gov. It contains only models which had a new
release every year between 1999 and 2008 - this was used as a proxy for the
popularity of the car.

### Usage

    data(mpg)

### Format

A data frame with 234 rows and 11 variables

### Details

  * manufacturer.

  * model.

  * displ. engine displacement, in litres

  * year.

  * cyl. number of cylinders

  * trans. type of transmission

  * drv. f = front-wheel drive, r = rear wheel drive, 4 = 4wd

  * cty. city miles per gallon

  * hwy. highway miles per gallon

  * fl.

  * class.

In [30]:
# How many rows and columns are in the dataset?
mpg.shape

(234, 11)

In [32]:
# Check out your column names and perform any cleanup you may want on them.
mpg.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 234 entries, 1 to 234
Data columns (total 11 columns):
 #   Column        Non-Null Count  Dtype
---  ------        --------------  -----
 0   manufacturer  234 non-null    object
 1   model         234 non-null    object
 2   displ         234 non-null    float64
 3   year          234 non-null    int64
 4   cyl           234 non-null    int64
 5   trans         234 non-null    object
 6   drv           234 non-null    object
 7   cty           234 non-null    int64
 8   hwy           234 non-null    int64
 9   fl            234 non-null    object
 10  class         234 non-null    object
dtypes: float64(1), int64(4), object(6)
memory usage: 21.9+ KB

In [34]:
mpg = mpg.rename(columns={'displ': 'displacement', 
                          'cyl': 'cylinder', 
                          'trans': 'transmission',
                          'drv': 'drivetrain',
                          'cty': 'city',
                          'hwy': 'highway',
                          'fl': 'fuel type'})

In [35]:
# Display the summary statistics for the dataset.
mpg.describe()

       displacement         year    cylinder        city     highway
count    234.000000   234.000000  234.000000  234.000000  234.000000
mean       3.471795  2003.500000    5.888889   16.858974   23.440171
std        1.291959     4.509646    1.611534    4.255946    5.954643
min        1.600000  1999.000000    4.000000    9.000000   12.000000
25%        2.400000  1999.000000    4.000000   14.000000   18.000000
50%        3.300000  2003.500000    6.000000   17.000000   24.000000
75%        4.600000  2008.000000    8.000000   19.000000   27.000000
max        7.000000  2008.000000    8.000000   35.000000   44.000000

In [37]:
# How many different manufacturers are there?
len(mpg['manufacturer'].unique())

15

In [39]:
# How many different models are there?
len(mpg['model'].unique())

38

In [40]:
# Create a column named mileage_difference like you did in the DataFrames exercises; this column should contain
# the difference between highway and city mileage for each car.

mpg['mileage_difference'] = mpg['highway'] - mpg['city']

In [41]:
# Create a column named average_mileage like you did in the DataFrames exercises; this is the mean of the city 
# and highway mileage.

mpg['average_mileage'] = (mpg['city'] + mpg['highway'])/2

In [44]:
# Create a new column on the mpg dataset named is_automatic that holds boolean values denoting whether the car
# has an automatic transmission.

mpg['is_automatic'] = mpg['transmission'].str.contains('auto')

In [67]:
# Using the mpg dataset, find out which which manufacturer has the best miles per gallon on average?

manu_miles = mpg.groupby('manufacturer').average_mileage.agg('mean')
manu_miles.nlargest(1)

manufacturer
honda    28.5
Name: average_mileage, dtype: float64

In [68]:
# Do automatic or manual cars have better miles per gallon?

trans_miles = mpg.groupby('is_automatic').average_mileage.agg('mean')
trans_miles

is_automatic
False    22.227273
True     19.130573
Name: average_mileage, dtype: float64